       IDENTIFICATION DIVISION.
       PROGRAM-ID. "BMICALCULATOR"

       ENVIRONMENT DIVISION. 

       DATA DIVISION. 
       WORKING-STORAGE SECTION. 
       01 WEIGHT PIC 999.
       01 HEIGHT_INCHES PIC 999.
       01 BMI PIC 999V99.

       PROCEDURE DIVISION.
       0100-START-HERE .


           STOP RUN.
       END PROGRAM BMICALCULATOR.
