       IDENTIFICATION DIVISION.
       PROGRAM-ID. "ENHANCEDBMICALCULATOR".


       ENVIRONMENT DIVISION. 

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
            SELECT BMI-FILE ASSIGN TO "BMI-INPUT.DAT"
               ORGANIZATION IS LINE SEQUENTIAL.
            SELECT PRINT-FILE ASSIGN TO "BMI-REPORT.DAT".

       DATA DIVISION.
       FILE SECTION.
         FD BMI-FILE.